/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOTv2
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/@coderxsa
   * @instagram : https://www.instagram.com/coderx.sa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version : 1.0
   * Donation : https://pay.yoco.com/coderx
   
   * For all my GitHub bots, I typically only check and update them when I have the time. My primary focus is on my main bots.
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOTv2.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x2f8012=_0x5366;function _0x2a62(){const _0x3ebbe1=['ɢᴏᴏᴅ\x20ɴɪɢʜᴛ\x20🌙','fun','error','contextInfo','live','996944aUmxoY','607956mnUlUl','ɢᴏᴏᴅ\x20ᴀғᴛᴇʀɴᴏᴏɴ\x20🌞','\x0a╭────────────────╮\x0a│\x20\x20\x20\x20*','send','time','caption','4890505VPIAvm','bot','861856OFUiIh','\x20\x0a│\x20\x20\x20\x20\x20*Date*\x20🎲\x20\x20\x20','*\x20\x0a│\x20\x20\x20\x20\x20*ᴛɪᴍᴇ*\x20⌚\x20','ɢᴏᴏᴅ\x20ᴇᴠᴇɴɪɴɢ\x20🌥','replace','493635BgYSOq','order','<group\x20link.>','462140KTVzEe','\x0a╰────────────────╯\x0a','fakeMessage','86471HeDPOf','split'];_0x2a62=function(){return _0x3ebbe1;};return _0x2a62();}function _0x5366(_0x5bc160,_0x216f78){const _0x2a620e=_0x2a62();return _0x5366=function(_0x53667d,_0x23536a){_0x53667d=_0x53667d-0xa2;let _0x1d391a=_0x2a620e[_0x53667d];return _0x1d391a;},_0x5366(_0x5bc160,_0x216f78);}(function(_0x441720,_0x4215ea){const _0x1f58c3=_0x5366,_0x1d7d9b=_0x441720();while(!![]){try{const _0x3b7fac=-parseInt(_0x1f58c3(0xa8))/0x1+parseInt(_0x1f58c3(0xba))/0x2+parseInt(_0x1f58c3(0xad))/0x3+-parseInt(_0x1f58c3(0xb0))/0x4+parseInt(_0x1f58c3(0xa6))/0x5+-parseInt(_0x1f58c3(0xbb))/0x6+parseInt(_0x1f58c3(0xb3))/0x7;if(_0x3b7fac===_0x4215ea)break;else _0x1d7d9b['push'](_0x1d7d9b['shift']());}catch(_0x404862){_0x1d7d9b['push'](_0x1d7d9b['shift']());}}}(_0x2a62,0x8c522));const {smd,Config}=require('../lib');smd({'pattern':_0x2f8012(0xb9),'desc':'Show\x20Live\x20Time\x20Of\x20Pakistan','category':_0x2f8012(0xb6),'filename':__filename,'use':_0x2f8012(0xaf)},async _0x5a7b35=>{const _0x18d9c9=_0x2f8012;try{var _0x194c49=(''+_0x5a7b35[_0x18d9c9(0xa4)])[_0x18d9c9(0xac)]('am','ᴀᴍ')['replace']('pm','ᴘᴍ'),_0x57c77a=_0x5a7b35['date'];const [_0x3fe768,_0x465e0f,_0x2ae5da,_0x3d20f1]=(''+_0x5a7b35[_0x18d9c9(0xa4)])[_0x18d9c9(0xb4)](/:| /),_0x431c6f=parseInt(_0x3fe768,0xa);var _0x2c3adc=_0x18d9c9(0xb5);if(_0x3d20f1=='am'){if(_0x431c6f>=0x0&&_0x431c6f<0x5)_0x2c3adc='ɢᴏᴏᴅ\x20ᴍᴏʀɴɪɴɢ,\x20ᴇᴀʀʟʏ\x20ʙɪʀᴅ!\x20🌄';else{if(_0x431c6f>=0x5&&_0x431c6f<0xc)_0x2c3adc='ɢᴏᴏᴅ\x20ᴍᴏʀɴɪɴɢ\x20⛅';}}else{if(_0x431c6f>=0x0&&_0x431c6f<0x5)_0x2c3adc=_0x18d9c9(0xbc);else{if(_0x431c6f>=0x5&&_0x431c6f<0x8)_0x2c3adc=_0x18d9c9(0xab);else _0x2c3adc=_0x18d9c9(0xb5);}}const _0x1e8aaa=await _0x5a7b35[_0x18d9c9(0xa7)][_0x18d9c9(0xb2)](_0x18d9c9(0xae));let _0x3dc086={...await _0x5a7b35[_0x18d9c9(0xa7)][_0x18d9c9(0xb8)]()},_0xa048d4=_0x18d9c9(0xa2)+_0x2c3adc+_0x18d9c9(0xaa)+_0x194c49+_0x18d9c9(0xa9)+_0x57c77a+'\x20\x0a│\x20\x20\x20'+Config[_0x18d9c9(0xa5)]+_0x18d9c9(0xb1);await _0x5a7b35[_0x18d9c9(0xa3)](_0xa048d4,{'contextInfo':_0x3dc086},'anita',_0x1e8aaa);}catch(_0x40f706){await _0x5a7b35[_0x18d9c9(0xb7)](_0x40f706+'\x0a\x0acommand:\x20live',_0x40f706,![]);}});