/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOTv2
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/@coderxsa
   * @instagram : https://www.instagram.com/coderx.sa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version : 1.0
   * Donation : https://pay.yoco.com/coderx
   
   * For all my GitHub bots, I typically only check and update them when I have the time. My primary focus is on my main bots.
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOTv2.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x1b36(){const _0x101602=['../lib','reply','58094AArsyS','teddy','isPublic','anita','1331616lLGEsW','2607645EYWkOM','(\x5c_/)\x0a(\x20•.•)\x0a/>🤍','1168086kDkjif','18012546RiMnwn','7sEsfDM','19jOPmIV','toLowerCase','236694qWbEeS','(\x5c_/)\x0a(\x20•.•)\x0a/>','cute\x20teddy','4711480bqNxvY','text','length','10LDMxHq','includes'];_0x1b36=function(){return _0x101602;};return _0x1b36();}const _0x23b2d5=_0x4e58;(function(_0x529342,_0x2e1b8a){const _0x4ebd08=_0x4e58,_0x4972b6=_0x529342();while(!![]){try{const _0x1ab33e=parseInt(_0x4ebd08(0xfa))/0x1*(-parseInt(_0x4ebd08(0xf0))/0x2)+-parseInt(_0x4ebd08(0xf7))/0x3+parseInt(_0x4ebd08(0xf4))/0x4+-parseInt(_0x4ebd08(0xf5))/0x5+parseInt(_0x4ebd08(0xfc))/0x6*(parseInt(_0x4ebd08(0xf9))/0x7)+-parseInt(_0x4ebd08(0xff))/0x8+-parseInt(_0x4ebd08(0xf8))/0x9*(-parseInt(_0x4ebd08(0xec))/0xa);if(_0x1ab33e===_0x2e1b8a)break;else _0x4972b6['push'](_0x4972b6['shift']());}catch(_0x3a43e3){_0x4972b6['push'](_0x4972b6['shift']());}}}(_0x1b36,0x4e9ec));function _0x4e58(_0x5320a3,_0x549e00){const _0x1b363b=_0x1b36();return _0x4e58=function(_0x4e58f6,_0x46af4e){_0x4e58f6=_0x4e58f6-0xea;let _0x5d1170=_0x1b363b[_0x4e58f6];return _0x5d1170;},_0x4e58(_0x5320a3,_0x549e00);}const {smd,sleep}=require(_0x23b2d5(0xee)),teddyM={'smd':_0x23b2d5(0xf3)};smd({'cmdname':'teddy','type':'fun','info':_0x23b2d5(0xfe),'on':_0x23b2d5(0xea),'filename':__filename},async(_0x3f579a,_0x3cffb9,{smd:_0x47f4fb})=>{const _0x13291c=_0x23b2d5;let _0x52a2dd=_0x47f4fb===_0x13291c(0xf1)?!![]:_0x3f579a[_0x13291c(0xf2)]&&_0x3cffb9[_0x13291c(0xfb)]()[_0x13291c(0xed)]('teddy')?!![]:'';if(_0x52a2dd&&!teddyM[_0x3f579a['id']]){teddyM[_0x3f579a['id']]=!![];let _0x26f144=['❤','💕','😻','🧡','💛','💚','💙','💜','🖤','❣','💞','💓','💗','💖','💘','💝','💟','♥','💌','🙂','🤗','😌','😉','🤗','😊','🎊','🎉','🎁','🎈'];const {key:_0x23068e}=await _0x3f579a['reply'](_0x13291c(0xf6));for(let _0x1867c4=0x0;_0x1867c4<_0x26f144[_0x13291c(0xeb)];_0x1867c4++){await sleep(0x1f4),await _0x3f579a[_0x13291c(0xef)](_0x13291c(0xfd)+_0x26f144[_0x1867c4],{'edit':_0x23068e});}}});